## Pandas- Dataframe and Series
- Powerful data manipulation lib in Python, used for data analysis and cleaning.

- Provides two primary data structures: Series and DataFrame.

Series:
- 1D array like object

DataFrame:
- 2D, size-mutable, and potentially heterogenous tabular data structute with labelled axes(rows and columns)

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\dell\desktop\python_udemy\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dell\desktop\python_udemy\venv\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\desktop\python_udemy\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dell\desktop\python_udemy\venv\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\dell\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
## Create a series from dictionary
data={'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [4]:
data=[10,20,30]
index=['a', 'b', 'c']
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [5]:
### Dataframe
## Create a DataFrame from a dictionary of list

data={
    'Name':['Anish','John', 'Jack'],
    'Age':[23,25,28],
    'City':['Delhi','Nanglore','Mumbai']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Anish   23     Delhi
1   John   25  Nanglore
2   Jack   28    Mumbai
<class 'pandas.core.frame.DataFrame'>

In [6]:
import numpy as np
np.array(df)

array([['Anish', 23, 'Delhi'],
       ['John', 25, 'Nanglore'],
       ['Jack', 28, 'Mumbai']], dtype=object)

In [7]:
## Create a DataFrame from a list of dictionaries
data=[
    {'Name':'Anish','Age':23, 'City':'Delhi'},
    {'Name':'John','Age':24, 'City':'Agra'},
    {'Name':'Jack','Age':26, 'City':'Banglore'},
    {'Name':'Ads','Age':21, 'City':'Dadra'},
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Anish   23     Delhi
1   John   24      Agra
2   Jack   26  Banglore
3    Ads   21     Dadra
<class 'pandas.core.frame.DataFrame'>

In [11]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0
1,1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7
2,2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",12,11.95,New York City,18
3,3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15
4,4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12

In [12]:
df.tail()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
185945,13617,222905,AAA Batteries (4-pack),1,2.99,2019-06-07 19:02:00,"795 Pine St, Boston, MA 02215",6,2.99,Boston,19
185946,13618,222906,27in FHD Monitor,1,149.99,2019-06-01 19:29:00,"495 North St, New York City, NY 10001",6,149.99,New York City,19
185947,13619,222907,USB-C Charging Cable,1,11.95,2019-06-22 18:57:00,"319 Ridge St, San Francisco, CA 94016",6,11.95,San Francisco,18
185948,13620,222908,USB-C Charging Cable,1,11.95,2019-06-26 18:35:00,"916 Main St, San Francisco, CA 94016",6,11.95,San Francisco,18
185949,13621,222909,AAA Batteries (4-pack),1,2.99,2019-06-25 14:33:00,"209 11th St, Atlanta, GA 30301",6,2.99,Atlanta,14

In [17]:
### Accessing data from dataframe
data
df1=pd.DataFrame(data)
df1

    Name  Age      City
0  Anish   23     Delhi
1   John   24      Agra
2   Jack   26  Banglore
3    Ads   21     Dadra

In [18]:
df1['Name']

0    Anish
1     John
2     Jack
3      Ads
Name: Name, dtype: object

In [21]:
df1.loc[0]

Name    Anish
Age        23
City    Delhi
Name: 0, dtype: object

In [22]:
df1.iloc[0]

Name    Anish
Age        23
City    Delhi
Name: 0, dtype: object

In [24]:
df1.loc[0][0]

C:\Users\Dell\AppData\Local\Temp\ipykernel_2900\750844073.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1.loc[0][0]

'Anish'

In [25]:
# Accessing a specified element
df1.at[1, 'Age']

np.int64(24)

In [26]:
df1.at[2, 'Name']

'Jack'

In [27]:
## Accessing a specified element using iat
df1.iat[2,2]

'Banglore'

In [40]:
### Data manipulation with dataframes
df1['salary']=[50000, 60000, 70000, 80000]
df1

    Name  Age      City  salary
0  Anish   23     Delhi   50000
1   John   24      Agra   60000
2   Jack   26  Banglore   70000
3    Ads   21     Dadra   80000

In [41]:
# Drop a column
df1.drop('salary', axis=1, inplace=True)

In [42]:
df1

    Name  Age      City
0  Anish   23     Delhi
1   John   24      Agra
2   Jack   26  Banglore
3    Ads   21     Dadra

In [44]:
# Add age to the column
df1['Age']=df1['Age']+1
df1

    Name  Age      City
0  Anish   24     Delhi
1   John   25      Agra
2   Jack   27  Banglore
3    Ads   22     Dadra

In [47]:
df1.drop(0, inplace=True)
df1

   Name  Age      City
1  John   25      Agra
2  Jack   27  Banglore
3   Ads   22     Dadra

In [48]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0
1,1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7
2,2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",12,11.95,New York City,18
3,3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15
4,4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12

In [51]:
# Display types of each column
print("Data types:/n", df.dtypes)


# Describe the dataframe
print("Statistical summary:\n", df.describe())

# Group by a column and perform an aggregation
# grouped=df.groupby('Category')['Value'].mean()
# print("Mean value by category:\n", grouped)

Data types:/n Unnamed: 0            int64
Order ID              int64
Product              object
Quantity Ordered      int64
Price Each          float64
Order Date           object
Purchase Address     object
Month                 int64
Sales               float64
City                 object
Hour                  int64
dtype: object
Statistical summary:
           Unnamed: 0       Order ID  Quantity Ordered     Price Each  \
count  185950.000000  185950.000000     185950.000000  185950.000000
mean     8340.388475  230417.569379          1.124383     184.399735
std      5450.554093   51512.737110          0.442793     332.731330
min         0.000000  141234.000000          1.000000       2.990000
25%      3894.000000  185831.250000          1.000000      11.950000
50%      7786.000000  230367.500000          1.000000      14.950000
75%     11872.000000  275035.750000          1.000000     150.000000
max     25116.000000  319670.000000          9.000000    1700.000000

               Month          Sales           Hour
count  185950.000000  185950.000000  185950.000000
mean        7.059140     185.490917      14.413305
std         3.502996     332.919771       5.423416
min         1.000000       2.990000       0.000000
25%         4.000000      11.950000      11.000000
50%         7.000000      14.950000      15.000000
75%        10.000000     150.000000      19.000000
max        12.000000    3400.000000      23.000000

In [52]:
df.describe()

,Unnamed: 0,Order ID,Quantity Ordered,Price Each,Month,Sales,Hour
count,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000,185950.000000
mean,8340.388475,230417.569379,1.124383,184.399735,7.059140,185.490917,14.413305
std,5450.554093,51512.737110,0.442793,332.731330,3.502996,332.919771,5.423416
min,0.000000,141234.000000,1.000000,2.990000,1.000000,2.990000,0.000000
25%,3894.000000,185831.250000,1.000000,11.950000,4.000000,11.950000,11.000000
50%,7786.000000,230367.500000,1.000000,14.950000,7.000000,14.950000,15.000000
75%,11872.000000,275035.750000,1.000000,150.000000,10.000000,150.000000,19.000000
max,25116.000000,319670.000000,9.000000,1700.000000,12.000000,3400.000000,23.000000